In [2]:
#!pip install pandas
import pandas as pd
import numpy as np

ImportError: Unable to import required dependencies:
numpy:

IMPORTANT: PLEASE READ THIS FOR ADVICE ON HOW TO SOLVE THIS ISSUE!

Importing the numpy C-extensions failed. This error can happen for
many reasons, often due to issues with your setup or how NumPy was
installed.

We have compiled some common reasons and troubleshooting tips at:

    https://numpy.org/devdocs/user/troubleshooting-importerror.html

Please note and check the following:

  * The Python version is: Python3.9 from "C:\ProgramData\Anaconda3\python.exe"
  * The NumPy version is: "1.20.3"

and make sure that they are the versions you expect.
Please carefully study the documentation linked above for further help.

Original error was: DLL load failed while importing _multiarray_umath: The specified module could not be found.

In [4]:
s1 = pd.Series([23,45,56])
s1

0    23
1    45
2    56
dtype: int64

In [6]:
s3 = pd.Series([98,89,86,23,45],index = ['a','b','c','d','e'],dtype= 'float')
s3

a    98.0
b    89.0
c    86.0
d    23.0
e    45.0
dtype: float64

In [7]:
s3['b']

89.0

In [8]:
s4=pd.Series({'d':901,'f':543,'r':21})
s4

d    901
f    543
r     21
dtype: int64

In [10]:
d1=pd.DataFrame([45,89,65,12,56,90])
d1

    0
0  45
1  89
2  65
3  12
4  56
5  90

In [12]:
d2=pd.DataFrame([[67,88,443],[4,32,12],[88,66,34]])
d2

    0   1    2
0  67  88  443
1   4  32   12
2  88  66   34

In [14]:
d2=pd.DataFrame(s2)
d2

    0
a  23
b  45
c  67
d  12

In [16]:
d3=pd.DataFrame([[9,7,5],[5,6,3],[2,5,6]],columns=['a','b','c'])
d3

   a  b  c
0  9  7  5
1  5  6  3
2  2  5  6

In [17]:
d3=pd.DataFrame([[8,9,5],[2,6,4],[6,7,8]],columns=['a','b','c'],index=['x','y','z'])
d3

   a  b  c
x  8  9  5
y  2  6  4
z  6  7  8

In [21]:
naveen=[{'nave':4,'phan':7},{'mani':10,'srinu':56}]
pd.DataFrame(naveen,index=['a','b'],dtype=int)

   nave  phan  mani  srinu
a   4.0   7.0   NaN    NaN
b   NaN   NaN  10.0   56.0

In [19]:
d3

   a  b  c
x  8  9  5
y  2  6  4
z  6  7  8

In [20]:
d3['a']

x    8
y    2
z    6
Name: a, dtype: int64

In [22]:
d3['d']=d3['a']*d3['b']
d3['e']=d3['a']*d3['d']
d3

   a  b  c   d    e
x  8  9  5  72  576
y  2  6  4  12   24
z  6  7  8  42  252

In [23]:
pop = d3.pop('b')
d3

   a  c   d    e
x  8  5  72  576
y  2  4  12   24
z  6  8  42  252

In [24]:
d3

   a  c   d    e
x  8  5  72  576
y  2  4  12   24
z  6  8  42  252

In [ ]:
del d3['d']

In [25]:
d3

   a  c   d    e
x  8  5  72  576
y  2  4  12   24
z  6  8  42  252

In [30]:
d3.pop('a')
d3

   c   d    e
x  5  72  576
y  4  12   24
z  8  42  252

In [32]:
d3.insert(1,'new1',d3['c'])
d3

   c  new1   d    e
x  5     5  72  576
y  4     4  12   24
z  8     8  42  252

In [43]:
import numpy as np
d4=pd.DataFrame({'abc':np.random.randint(2,6,size = (10)),'bcd':np.random.randint(4,10,size=(10))})
d4

   abc  bcd
0    3    6
1    3    9
2    3    9
3    5    8
4    5    6
5    3    7
6    4    8
7    3    7
8    5    5
9    4    9

In [44]:
d4.head()

   abc  bcd
0    3    6
1    3    9
2    3    9
3    5    8
4    5    6

In [36]:
d4.tail()

   abc  bcd
5    5    7
6    4    6
7    5    9
8    4    7
9    2    5

In [37]:
d4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   abc     10 non-null     int32
 1   bcd     10 non-null     int32
dtypes: int32(2)
memory usage: 208.0 bytes

In [45]:
d4

   abc  bcd
0    3    6
1    3    9
2    3    9
3    5    8
4    5    6
5    3    7
6    4    8
7    3    7
8    5    5
9    4    9

In [46]:
d4.loc[9,'bcd']

9

In [47]:
d4.loc[4:9,['abc','bcd']]

   abc  bcd
4    5    6
5    3    7
6    4    8
7    3    7
8    5    5
9    4    9

In [49]:
d4.loc[[6,7,8],['abc','bcd']]

   abc  bcd
6    4    8
7    3    7
8    5    5

In [50]:
d4

   abc  bcd
0    3    6
1    3    9
2    3    9
3    5    8
4    5    6
5    3    7
6    4    8
7    3    7
8    5    5
9    4    9

In [54]:
d4.iloc[9,1]

9

In [55]:
d4.iloc[2:7,[0,1]]

   abc  bcd
2    3    9
3    5    8
4    5    6
5    3    7
6    4    8

In [56]:
d4.abc

0    3
1    3
2    3
3    5
4    5
5    3
6    4
7    3
8    5
9    4
Name: abc, dtype: int32

In [57]:
d4.abc.values

array([3, 3, 3, 5, 5, 3, 4, 3, 5, 4])

In [58]:
d4['sum']=d4.abc.values +d4.bcd.values
d4

   abc  bcd  sum
0    3    6    9
1    3    9   12
2    3    9   12
3    5    8   13
4    5    6   11
5    3    7   10
6    4    8   12
7    3    7   10
8    5    5   10
9    4    9   13

In [60]:
a =[['rck',208,20000],['ravi',209,25000],['kiran',210,30000]]
dfl=pd.DataFrame(a,columns = ['name','id','salary'])
dfl

    name   id  salary
0    rck  208   20000
1   ravi  209   25000
2  kiran  210   30000

In [64]:
y=dfl[dfl.salary>=20000]

In [65]:
y[['id','salary']]

    id  salary
0  208   20000
1  209   25000
2  210   30000

In [71]:
dfl.append({'name':'phani','id':211,'salary':35000},ignore_index=True)

    name   id  salary
0    rck  208   20000
1   ravi  209   25000
2  kiran  210   30000
3  phani  211   35000

In [76]:
dfl=dfl.append({'name':'np.nan','id' : 212,'salary' :40000},ignore_index=True)
dfl

     name   id  salary
0     rck  208   20000
1    ravi  209   25000
2   kiran  210   30000
3  np.nan  212   40000

In [77]:
dfl.isnull()

    name     id  salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False

In [79]:
dfl.isnull().sum()

name      0
id        0
salary    0
dtype: int64

In [80]:
dfl.dropna()

     name   id  salary
0     rck  208   20000
1    ravi  209   25000
2   kiran  210   30000
3  np.nan  212   40000

In [81]:
dfl

     name   id  salary
0     rck  208   20000
1    ravi  209   25000
2   kiran  210   30000
3  np.nan  212   40000

In [82]:
dfl.fillna(value ='abc')

     name   id  salary
0     rck  208   20000
1    ravi  209   25000
2   kiran  210   30000
3  np.nan  212   40000

In [83]:
df=pd.DataFrame({'animal':['falcon','falcon','parrot','parrot','parrot'],'max speed':[380,370,24,26,30]})
df

   animal  max speed
0  falcon        380
1  falcon        370
2  parrot         24
3  parrot         26
4  parrot         30

In [84]:
df.groupby(['animal']).mean()

         max speed
animal
falcon  375.000000
parrot   26.666667

In [87]:
df_csv = pd.read_csv('data.csv')
df_csv

FileNotFoundError: [Errno 2] No such file or directory: 'data.csv'